UploadBackend/app/controllers/uploads_controller.rb

SELECT * FROM "uploads"
---
  def index
    @uploads = Upload.all

SELECT * FROM "uploads" WHERE ("uploads"."id" = 1)
---
  def show
    upload = Upload.find(params[:id])

INSERT INTO "uploads" ("attachment_file_name", "updated_at", "attachment_file_size", "attachment_updated_at", "created_at", "attachment_content_type") VALUES('atomicphysics_summary.tex', '2009-11-02 21:51:54', 4367, '2009-11-02 21:51:54', '2009-11-02 21:51:54', 'application/x-tex')
---
  def create
    @upload = Upload.new(params[:upload])
    if @upload.save